test/tests/round_trip/buoyantFoam_serial/buoyantCavity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    frontAndBack
    {
        type            calculated;
        value           $internalField;
    }

    topAndBottom
    {
        type            calculated;
        value           $internalField;
    }

    hot
    {
        type            calculated;
        value           $internalField;
    }

    cold
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
